# Задание 1 : Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
a = 2             # Напечатаем фавзу "Hello!" 2 раза
b = 'Hello!'
print(b * a)
# Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
num1, num2, num3 = int(input()), int(input()),int(input()) # Запросим у пользователя несколько чисел
phrase1, phrase2, phrase3 = input(), input(), input() # Запросим у пользователя несколько строк
print(num1, num2, num3)
print(phrase1, phrase2, phrase3) # выведим на экран